Question 1 (8 points)
Choose either Python or R for the entirety of this question.

A U.S graduate school has students from Asia, Europe, and America. The students' continents of origin and colleges are stored in a data frame STUDENTS. You can assume that there may be duplicate records, as shown below:

| name   | continent |  college  |
|--------|-----------|-------------|
|  Andy  | America   |  Lib Arts   |
|  Jose  | Europe    |  Business   |
|  Dieu  | Asia      | Engineering |
|  Chloe | America   | Engineering |
|  Jose  | Europe    |  Business   |

A) Write R or Pandas code to de-dup STUDENTS (1pt):





B) Create a data frame COUNTS storing the count of students for each continent, college pair (2pts):





C) Pivot COUNTS so that continent values become column names (2pts)





D) If applicable, remove any unnecessary index levels created in part C (1pts):





E) Zero-fill missing values in COUNTS (1pt):





F) Sort COUNTS reverse alphabetically by college name (1pt):

Question 2 (6 points)
Choose either Python or R for the entirety of this question.

### Aswer:
Python: B, A, B

# Question 1 process

### (A, B) create data set

In [60]:
# Import pandas library 
import pandas as pd 

# initialize list of lists 
data = [['tom', 10], ['nick', 15], ['juli', 14]] 

columnlist = [ 'name'   , 'continent' ,  'college'  ];
data = [
['Andy'  , 'America'   ,  'Lib Arts'],  
[  'Jose'  , 'Europe'    ,  'Business'   ],
[  'Dieu'  , 'Asia'      , 'Engineering' ],
[  'Chloe' , 'America'   , 'Engineering' ],
[  'Jose'  , 'Europe'    ,  'Business'   ]
];

  
# Create the pandas DataFrame 
df = pd.DataFrame(data, columns = columnlist) 
  
# print dataframe. 
df

    name continent      college
0   Andy   America     Lib Arts
1   Jose    Europe     Business
2   Dieu      Asia  Engineering
3  Chloe   America  Engineering
4   Jose    Europe     Business

In [61]:
# remove duplicate rows
#because the same name does not indicate the same person, so duplicate is defined as: all columns are the same 
df = df.drop_duplicates(subset=columnlist, keep='first')
df

    name continent      college
0   Andy   America     Lib Arts
1   Jose    Europe     Business
2   Dieu      Asia  Engineering
3  Chloe   America  Engineering

In [62]:
#groupby
gb = df.groupby(['continent', 'college'])
#gb.agg({'col3': ['count']})
gb.agg(['count'])

                       name
                      count
continent college
America   Engineering     1
          Lib Arts        1
Asia      Engineering     1
Europe    Business        1

### (C)

In [63]:
#pivot
dfpivot = pd.pivot_table(df, #values='lifeExp',
                     index=['college'],
                     columns='continent',
                     #columns=['continent','college'],
                     aggfunc=['count'])

dfpivot

              count
               name
continent   America Asia Europe
college
Business        NaN  NaN    1.0
Engineering     1.0  1.0    NaN
Lib Arts        1.0  NaN    NaN

In [64]:
#fill nan values, sort index 
dfpivot = dfpivot[:].fillna(0)
dfpivot = dfpivot.sort_index(ascending=False)
dfpivot

              count
               name
continent   America Asia Europe
college
Lib Arts        1.0  0.0    0.0
Engineering     1.0  1.0    0.0
Business        0.0  0.0    1.0

In [65]:
print(dfpivot.columns)
print(dfpivot.columns.droplevel(level = [0,1]) )

MultiIndex(levels=[['count'], ['name'], ['America', 'Asia', 'Europe']],
           labels=[[0, 0, 0], [0, 0, 0], [0, 1, 2]],
           names=[None, None, 'continent'])
Index(['America', 'Asia', 'Europe'], dtype='object', name='continent')

### (D, E)

In [66]:
dfpivot.columns = dfpivot.columns.droplevel(level = [0,1])
dfpivot

continent    America  Asia  Europe
college
Lib Arts         1.0   0.0     0.0
Engineering      1.0   1.0     0.0
Business         0.0   0.0     1.0

In [67]:
#pivot
#pd.pivot_table(gb, #values='lifeExp',
#                     #index=['college'],
#                     columns='continent',
#                     aggfunc=['count'])

In [68]:
#dfpivot.reset_index(level=1, drop=True)
#dfpivot.rename_axis(None).rename_axis(None, axis=1)
#dfpivot.columns
#dfpivot.rename_axis(None).rename_axis(None, axis=0)

In [69]:
#dfpivot.columns

In [70]:
#dfpivot.columns.droplevel(level = [0,1])